In [1]:
people = {
    "first":["Samma","soni","saniya"],
    "last":["Khatoon","begam","firdous"],
    "email":["sammakhatoon677@gmail.com","sonibegam23@gmail.com", "saniyafirdous456@gmail.com"]
}

In [2]:
import pandas as pd

In [38]:
df=pd.DataFrame(people)

In [39]:
df

    first     last                       email
0   Samma  Khatoon   sammakhatoon677@gmail.com
1    soni    begam       sonibegam23@gmail.com
2  saniya  firdous  saniyafirdous456@gmail.com

In [40]:
df.set_index('email',inplace=True)

In [41]:
df

                             first     last
email
sammakhatoon677@gmail.com    Samma  Khatoon
sonibegam23@gmail.com         soni    begam
saniyafirdous456@gmail.com  saniya  firdous

In [42]:
df.index

Index(['sammakhatoon677@gmail.com', 'sonibegam23@gmail.com',
       'saniyafirdous456@gmail.com'],
      dtype='object', name='email')

In [44]:
df.loc['sammakhatoon677@gmail.com','last']

'Khatoon'

In [47]:
df.iloc[0]

first      Samma
last     Khatoon
Name: sammakhatoon677@gmail.com, dtype: object

In [48]:
df.reset_index(inplace=True)
df

                        email   first     last
0   sammakhatoon677@gmail.com   Samma  Khatoon
1       sonibegam23@gmail.com    soni    begam
2  saniyafirdous456@gmail.com  saniya  firdous